src/Catalogs/ИС_Ламода_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ламода_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_Ламода_Склады/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ОбщаяГруппаСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура УстановитьОформление()
		
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость                   = Ложь;
		Объект.ВыгружатьОстаткиИзГруппыСкладов             = Ложь;
		
	Иначе
		
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость                   = Объект.ВыгружатьОстаткиИзГруппыСкладов;
		
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
